# --- ЭТАП 1: Сборщик (Builder) ---
# Используем официальный образ Go с Alpine Linux в качестве базы. Он маленький и содержит всё для компиляции.
FROM golang:1.23-alpine AS builder

# Устанавливаем рабочую директорию внутри образа
WORKDIR /app

# Копируем файлы управления зависимостями
COPY go.mod go.sum ./
# Скачиваем зависимости. Этот слой будет кэшироваться, если файлы не менялись.
RUN go mod download

# Копируем остальной исходный код нашего приложения
COPY . .

# Собираем приложение.
# CGO_ENABLED=0 создает статически скомпилированный бинарный файл без внешних зависимостей.
# GOOS=linux компилирует для ОС Linux, которая будет в финальном образе.
RUN CGO_ENABLED=0 GOOS=linux go build -o /go-task-scheduler .


# --- ЭТАП 2: Финальный образ (Final Image) ---
# Используем минималистичный образ Alpine. В нём нет ничего лишнего.
FROM alpine:latest

# Устанавливаем рабочую директорию
WORKDIR /app

# Копируем ТОЛЬКО скомпилированный бинарный файл из образа-сборщика (этапа 'builder')
COPY --from=builder /go-task-scheduler .

# Копируем директорию с файлами фронтенда
COPY web ./web

# Сообщаем Docker, что контейнер будет слушать этот порт
EXPOSE 7540

# Команда, которая будет выполняться при запуске контейнера
CMD ["./go-task-scheduler"]
